# Создайте функцию, принимающую на вход имя, возраст и город проживания человека.
# Функция должна возвращать строку вида «Василий, 21 год(а), проживает в городе Москва»

def person (name, age, city):
    return str(('{}, {} год(а), проживает в городе {}'.format(name, age, city)))

print(person('Люба', 26, 'Новосибирск'))