# В этой игре человек загадывает число, а компьютер пытается его угадать.
# В начале игры человек загадывает число от 1 до 100 в уме или записывает его на листок бумаги.
# Компьютер начинает его отгадывать предлагая игроку варианты чисел. Если компьютер угадал число, игрок выбирает “победа”.
# Если компьютер назвал число меньше загаданного, игрок должен выбрать “загаданное число больше”.
# Если компьютер назвал число больше, игрок должен выбрать “загаданное число меньше”.
# Игра продолжается до тех пор пока компьютер не отгадает число.

import random
# человек загадываает число
print('Загадайте число от 0 до 100 и запомните его')
min = 1
max = 100

while True:
    number = random.randint(min, max)
    print(f'Загаданное число: {number}?')
    result = input('> < =')
    if result == '=':
        print('Победа')
        break
    elif result == '>':
        min = number + 1
    else:
        max = number - 1