# 2: Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# Элемент кратен 3,
# Элемент положительный,
# Элемент не кратен 4.
#
# Примечание: Список с целыми числами создайте вручную в начале файла.
# Не забудьте включить туда отрицательные числа. 10-20 чисел в списке вполне достаточно.

numbers = [4, -3, 6, -4, -11, 18, 13, 16, 9, 12, -3, 24, 99, 21]

result = [i for i in numbers if i >= 0 and i%3 and not i%4]
print(result)
