# Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операции.

number = int(input('Введите целое положительное число: '))
if number < 0:
    print('Err!')
else:
    print(number)

while
    p = number % 10
