# Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же
# значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

number = int(input("Enter number: "))
list = [7, 4, 3, 2]
a = list.count(number)
for element in list:
    if a > 0:
        i = list.index(number)
        list.insert(i+a, number)
        break
    else:
        if number > element:
            m = list.index(element)
            list.insert(m, number)
            break
        elif number < list[len(list) - 1]:
            list.append(number)
print(list)


