# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
from itertools import count, cycle

iterator = count(int(input('Введите число, с которого будет генерироваться последовательность')))
print('Первые 10 чисел, начиная с введенноо числа - ')

for i in range(10):
    print(next(iterator), end =' ')


print('\n- cycle -')
list = ['string', 101, 101.5456, 16.424]
iterator = cycle(list)

for i in range(len(list) * 2):
    print(next(iterator), end=' ')