# 2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя:
# имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы. Реализовать вывод данных о пользователе одной строкой.

# строкой
def data(**kwargs):
    return kwargs

print(data(name = 'Люба', surname = 'Новикова', year = 1995, city = 'Нск', email = '@@', phone = 8800))


# в столбик
def data2(**kwargs):
    for k, v in kwargs.items():
        print(k, v)

data2(name = 'Люба', surname = 'Новикова', year = 1995, city = 'Нск', email = '@@', phone = 8800)

