# Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма.
# Например, прибыль — выручка больше издержек, или убыток — издержки больше выручки.
# Выведите соответствующее сообщение.

# Если фирма отработала с прибылью, вычислите рентабельность выручки.
# Это отношение прибыли к выручке. Далее запросите численность сотрудников фирмы и определите прибыль
# фирмы в расчёте на одного сотрудника.

revenue = float(input('Введите выручку фирмы: '))
cost = float(input('Введите издержки фирмы: '))
profitability = []
employees = []

print('Выручка фирмы: ', revenue, 'Издержки фирмы: ', cost)

if revenue > cost:
    print(f"Фирма работает с прибылью. Рентабельность выручки: {revenue / cost:.2f}")
    employees = int(input('Введите число сотрудников: '))
    profitability = revenue / employees
    print(f"Прибыль фирмы в расчете на одного сотрудника: {revenue / employees:.2f}")
elif revenue < cost:
    print('Фирма работает в убыток')
else:
    print('Фирма ничего не потеряла и не заработала')