# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами.
# Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.

def my_func(x, y):
      if y < 0 and x > 0:
       result = x ** y
       return  result
      else:
       print('x > 0, y < 0')

print(my_func(6, 13))
print(my_func(10, -3))


def my_func(x, y):
    result = 1 / x ** abs(y)  if x > 0 and y < 0 else print('x > 0, y < 0')
    return result

print(my_func(2, -5))