# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

def numbers(n1, n2):
    try:
     result = n1 / n2
     return result
    except:
        print("Деление на 0")

n1 = int(input('Введите первое число: '))
n2 = int(input('Введите второе число, неравное 0: '))

print(numbers(n1, n2))