# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами.
# Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.

def my_func(x, y):
      if y < 0 or x > 0:
       result = x ** y
       return  result
      else:
       print('x > 0, y < 0')

print(my_func(6, 13))
print(my_func(10, -3))


def my_func(x, y):
    try:
        if x <= 0 or y >= 0:
            return 'x должен быть больше 0, y должен быть меньше 0'
        else:
            res = 1
            for _ in range(abs(y)):
                res = 1 / x
                return 'Результат возведения в степень: {}'.format(res)
    except ValueError:
        return 'Необходимо ввести числа'

print(my_func(20, -60))