# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.


def sum():
 el = 0
 while True:
  str_user = list(input('Input numbers. Enter "q" to end the program: ').split())
  for numb in str_user:
         if numb == 'q':
          return el
         else:
             try:
              el += int(numb)
             except ValueError:
              print('End')

print(sum())