# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.

while True:
 new_str = []
 str_user = list(input('Введите строку чисел, разделяя их пробелом: ').split())
 for i in str_user:
  map(lambda i: int, str_user)
  new_str.append(i)
 print(sum(new_str))
 if i == 'q':
   break
