# Дан список заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут только уникальные элементы исходного.
#     Примечание. Списки создайте вручную, например так:
# my_list_1 = [2, 2, 5, 12, 8, 2, 12]

# В этом случае ответ будет:
# [5, 8]

my_list_1 = [2, 2, 5, 12, 8, 2, 12]
print(my_list_1)
new = []

for i in range(len(my_list_1)):
    for j in range(len(my_list_1)):
        if i != j and my_list_1[i] == my_list_1[j]:
            break
    else:
        new.append(my_list_1[i])
print(new)