# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

# брать каждый элемент по индексу и проверять его тип
list = ['Apple', 26, 43.226, True, [7,9,11]]
print('Количество элементов в списке: ', list)
print(len(list))

for number in list:
    print(type(number))